# GetMaterialName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetMaterialName Method
FabricationConfiguration Class See Also
---
Gets material name from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetMaterialName(
	int materialId
)
```

Visual Basic
---
```text
Public Function GetMaterialName ( _
	materialId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetMaterialName(
	int materialId
)
```

# ### Parameters
materialId
    Type: System..::..Int32 The material identifier.
# ### Return Value
The material name without the group.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace